#include <stdio.h>
#include <math.h>

/*

السؤال:

قم بعمل برنامج بلغة سي يقوم بإنشاء موشر،
 وبين كيفية الوصول إلى القيم والعنوانين

*/

int main()
{
    // الخطوة الأولى: إنشاء وتعريف المتغير
    int x = 10;
   // الخطوة الثانية: إنشاء وتعريف المؤشر
    int *p = &x;
   //با الخطوة التالثة: طباعة القيمة والعنوان باستخدام المؤشر
    printf(" قمية  x = %d\n عنوان x = %p \n", *p, p);


     //با الخطوة التالثة: طباعة القيمة والعنوان باستخدام المتغير
    printf(" قمية  x = %d\n عنوان x = %p \n", x, &x);


}
